app/views/orders/show.html.erb

    <tbody>
    <% @order.order_details.each do |detail| %>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."oid" = ? LIMIT 1  [["oid", "11477432492301869735705405557915158557"]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]