app/controllers/orders_controller.rb

DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 4]]
---
  def destroy
    @order = get_order
    @order.destroy

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "orders" ("user_id", "oid", "status", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["oid", "11477432492301869735705405557915158557"], ["status", "f"], ["amount", 0.0], ["created_at", "2015-10-24 19:27:36.338684"], ["updated_at", "2015-10-24 19:27:36.338684"]]
SELECT  "products".* FROM "products" WHERE "products"."pid" = ? LIMIT 1  [["pid", "6920202888883"]]
INSERT INTO "order_details" ("product_id", "order_id", "price", "count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 4], ["order_id", 2], ["price", 6.0], ["count", 2], ["created_at", "2015-10-24 19:27:36.382810"], ["updated_at", "2015-10-24 19:27:36.382810"]]
UPDATE "orders" SET "amount" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["amount", 12.0], ["updated_at", "2015-10-24 19:27:36.393157"], ["id", 2]]
---
  def create
    order_details = params[:order_details]

    if order_details.to_a.empty?
      render :json => {order: nil}
    end

    @order = Order.new

    @order.user = User.first
    @order.oid = UUIDTools::UUID.random_create.to_i.to_s
    @order.status = false
    @order.amount = 0
    @order.process = false
    @order.save

    order_details.each do |detail|
      order_detail = OrderDetail.new
      order_detail.product = Product.find_by_pid(detail[:pid])
      order_detail.order = @order
      order_detail.price = detail[:price]
      order_detail.count = detail[:count]
      order_detail.save