app/controllers/orders_controller.rb

  def show
    @order = Order.find_by_oid(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."oid" = ? LIMIT 1  [["oid", "11477432492301869735705405557915158557"]]