app/controllers/products_controller.rb

  def create
    product = Product.new(product_param)
    if product.save
---
INSERT INTO "products" ("pid", "name", "price", "avatar", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def find_a_product
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."pid" = ? LIMIT 1  [["pid", "6925303721398"]]